; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	image1 - mode
	spectrograph2 - mode
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star7)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite0 Planet11)
	(pointing satellite2 Phenomenon14)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 image1)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 image1)
	(have_image Planet12 image1)
	(have_image Phenomenon13 thermograph0)
	(have_image Phenomenon14 thermograph0)
	(have_image Phenomenon15 image1)
	(have_image Phenomenon16 image1)
))

)

; plan
1. (turn_to satellite2 groundstation1 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 11
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 11
3. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 11
4. (turn_to satellite2 planet11 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet11)
   goals met: 0 of 11
5. (take_image satellite2 planet11 instrument4 image1)
   added: (have_image planet11 image1)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon16 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon16)
   goals met: 1 of 11
7. (take_image satellite2 phenomenon16 instrument4 image1)
   added: (have_image phenomenon16 image1)
   goals met: 2 of 11
8. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 11
9. (take_image satellite2 phenomenon15 instrument4 image1)
   added: (have_image phenomenon15 image1)
   goals met: 3 of 11
10. (turn_to satellite2 phenomenon13 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon13)
   goals met: 3 of 11
11. (take_image satellite2 phenomenon13 instrument4 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 4 of 11
12. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 11
13. (take_image satellite2 phenomenon10 instrument4 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 5 of 11
14. (turn_to satellite0 planet11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet11)
   goals met: 6 of 11
15. (turn_to satellite2 planet12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet12)
   goals met: 6 of 11
16. (take_image satellite2 planet12 instrument4 image1)
   added: (have_image planet12 image1)
   goals met: 7 of 11
17. (turn_to satellite2 planet8 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet8)
   goals met: 7 of 11
18. (take_image satellite2 planet8 instrument4 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 8 of 11
19. (turn_to satellite2 planet9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet9)
   goals met: 8 of 11
20. (take_image satellite2 planet9 instrument4 image1)
   added: (have_image planet9 image1)
   goals met: 9 of 11
21. (turn_to satellite2 phenomenon14 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon14)
   goals met: 10 of 11
22. (take_image satellite2 phenomenon14 instrument4 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 11 of 11
